YassineOABA/stm32f407_Breakout_VS_FW/Core/Inc/Bmi160/bmi160_defs.h
/** Mask definitions for INT_MOTION register */
#define BMI160_SLOPE_INT_DUR_MASK                 UINT8_C(0x03)
#define BMI160_NO_MOTION_INT_DUR_MASK             UINT8_C(0xFC)
#define BMI160_NO_MOTION_SEL_BIT_MASK             UINT8_C(0x01)

/** Mask definitions for INT_TAP register */
#define BMI160_TAP_DUR_MASK                       UINT8_C(0x07)
#define BMI160_TAP_SHOCK_DUR_MASK                 UINT8_C(0x40)
#define BMI160_TAP_QUIET_DUR_MASK                 UINT8_C(0x80)
#define BMI160_TAP_THRES_MASK                     UINT8_C(0x1F)

/** Mask definitions for INT_FLAT register */
#define BMI160_FLAT_THRES_MASK                    UINT8_C(0x3F)
#define BMI160_FLAT_HOLD_TIME_MASK                UINT8_C(0x30)
#define BMI160_FLAT_HYST_MASK                     UINT8_C(0x07)

/** Mask definitions for INT_LOWHIGH register */
#define BMI160_LOW_G_HYST_MASK                    UINT8_C(0x03)
#define BMI160_LOW_G_LOW_MODE_MASK                UINT8_C(0x04)
#define BMI160_HIGH_G_HYST_MASK                   UINT8_C(0xC0)

/** Mask definitions for INT_SIG_MOTION register */
#define BMI160_SIG_MOTION_SEL_MASK                UINT8_C(0x02)
#define BMI160_SIG_MOTION_SKIP_MASK               UINT8_C(0x0C)
#define BMI160_SIG_MOTION_PROOF_MASK              UINT8_C(0x30)

/** Mask definitions for INT_ORIENT register */
#define BMI160_ORIENT_MODE_MASK                   UINT8_C(0x03)
#define BMI160_ORIENT_BLOCK_MASK                  UINT8_C(0x0C)
#define BMI160_ORIENT_HYST_MASK                   UINT8_C(0xF0)
#define BMI160_ORIENT_THETA_MASK                  UINT8_C(0x3F)
#define BMI160_ORIENT_UD_ENABLE                   UINT8_C(0x40)
#define BMI160_AXES_EN_MASK                       UINT8_C(0x80)

/** Mask definitions for FIFO_CONFIG register */
#define BMI160_FIFO_GYRO                          UINT8_C(0x80)
#define BMI160_FIFO_ACCEL                         UINT8_C(0x40)
#define BMI160_FIFO_AUX                           UINT8_C(0x20)
#define BMI160_FIFO_TAG_INT1                      UINT8_C(0x08)
#define BMI160_FIFO_TAG_INT2                      UINT8_C(0x04)
#define BMI160_FIFO_TIME                          UINT8_C(0x02)
#define BMI160_FIFO_HEADER                        UINT8_C(0x10)
#define BMI160_FIFO_CONFIG_1_MASK                 UINT8_C(0xFE)

/** Mask definitions for STEP_CONF register */
#define BMI160_STEP_COUNT_EN_BIT_MASK             UINT8_C(0x08)
#define BMI160_STEP_DETECT_MIN_THRES_MASK         UINT8_C(0x18)
#define BMI160_STEP_DETECT_STEPTIME_MIN_MASK      UINT8_C(0x07)
#define BMI160_STEP_MIN_BUF_MASK                  UINT8_C(0x07)

/** Mask definition for FIFO Header Data Tag */
#define BMI160_FIFO_TAG_INTR_MASK                 UINT8_C(0xFC)

/** Fifo byte counter mask definitions */
#define BMI160_FIFO_BYTE_COUNTER_MASK             UINT8_C(0x07)

/** Enable/disable bit value */
#define BMI160_ENABLE                             UINT8_C(0x01)
#define BMI160_DISABLE                            UINT8_C(0x00)

/** Latch Duration */
#define BMI160_LATCH_DUR_NONE                     UINT8_C(0x00)
#define BMI160_LATCH_DUR_312_5_MICRO_SEC          UINT8_C(0x01)
#define BMI160_LATCH_DUR_625_MICRO_SEC            UINT8_C(0x02)
#define BMI160_LATCH_DUR_1_25_MILLI_SEC           UINT8_C(0x03)
#define BMI160_LATCH_DUR_2_5_MILLI_SEC            UINT8_C(0x04)
#define BMI160_LATCH_DUR_5_MILLI_SEC              UINT8_C(0x05)
#define BMI160_LATCH_DUR_10_MILLI_SEC             UINT8_C(0x06)
#define BMI160_LATCH_DUR_20_MILLI_SEC             UINT8_C(0x07)
#define BMI160_LATCH_DUR_40_MILLI_SEC             UINT8_C(0x08)
#define BMI160_LATCH_DUR_80_MILLI_SEC             UINT8_C(0x09)
#define BMI160_LATCH_DUR_160_MILLI_SEC            UINT8_C(0x0A)
#define BMI160_LATCH_DUR_320_MILLI_SEC            UINT8_C(0x0B)
#define BMI160_LATCH_DUR_640_MILLI_SEC            UINT8_C(0x0C)
#define BMI160_LATCH_DUR_1_28_SEC                 UINT8_C(0x0D)
#define BMI160_LATCH_DUR_2_56_SEC                 UINT8_C(0x0E)
#define BMI160_LATCHED                            UINT8_C(0x0F)

/** BMI160 Register map */
#define BMI160_CHIP_ID_ADDR                       UINT8_C(0x00)
#define BMI160_ERROR_REG_ADDR                     UINT8_C(0x02)
#define BMI160_PMU_STATUS_ADDR                    UINT8_C(0x03)
#define BMI160_AUX_DATA_ADDR                      UINT8_C(0x04)
#define BMI160_GYRO_DATA_ADDR                     UINT8_C(0x0C)
#define BMI160_ACCEL_DATA_ADDR                    UINT8_C(0x12)
#define BMI160_STATUS_ADDR                        UINT8_C(0x1B)
#define BMI160_INT_STATUS_ADDR                    UINT8_C(0x1C)
#define BMI160_FIFO_LENGTH_ADDR                   UINT8_C(0x22)
#define BMI160_FIFO_DATA_ADDR                     UINT8_C(0x24)
#define BMI160_ACCEL_CONFIG_ADDR                  UINT8_C(0x40)
#define BMI160_ACCEL_RANGE_ADDR                   UINT8_C(0x41)
#define BMI160_GYRO_CONFIG_ADDR                   UINT8_C(0x42)
#define BMI160_GYRO_RANGE_ADDR                    UINT8_C(0x43)
#define BMI160_AUX_ODR_ADDR                       UINT8_C(0x44)
#define BMI160_FIFO_DOWN_ADDR                     UINT8_C(0x45)
#define BMI160_FIFO_CONFIG_0_ADDR                 UINT8_C(0x46)
#define BMI160_FIFO_CONFIG_1_ADDR                 UINT8_C(0x47)
#define BMI160_AUX_IF_0_ADDR                      UINT8_C(0x4B)
#define BMI160_AUX_IF_1_ADDR                      UINT8_C(0x4C)
#define BMI160_AUX_IF_2_ADDR                      UINT8_C(0x4D)
#define BMI160_AUX_IF_3_ADDR                      UINT8_C(0x4E)
#define BMI160_AUX_IF_4_ADDR                      UINT8_C(0x4F)
#define BMI160_INT_ENABLE_0_ADDR                  UINT8_C(0x50)
#define BMI160_INT_ENABLE_1_ADDR                  UINT8_C(0x51)
#define BMI160_INT_ENABLE_2_ADDR                  UINT8_C(0x52)
#define BMI160_INT_OUT_CTRL_ADDR                  UINT8_C(0x53)
#define BMI160_INT_LATCH_ADDR                     UINT8_C(0x54)
#define BMI160_INT_MAP_0_ADDR                     UINT8_C(0x55)
#define BMI160_INT_MAP_1_ADDR                     UINT8_C(0x56)
#define BMI160_INT_MAP_2_ADDR                     UINT8_C(0x57)
#define BMI160_INT_DATA_0_ADDR                    UINT8_C(0x58)
#define BMI160_INT_DATA_1_ADDR                    UINT8_C(0x59)
#define BMI160_INT_LOWHIGH_0_ADDR                 UINT8_C(0x5A)
#define BMI160_INT_LOWHIGH_1_ADDR                 UINT8_C(0x5B)
#define BMI160_INT_LOWHIGH_2_ADDR                 UINT8_C(0x5C)
#define BMI160_INT_LOWHIGH_3_ADDR                 UINT8_C(0x5D)
#define BMI160_INT_LOWHIGH_4_ADDR                 UINT8_C(0x5E)
#define BMI160_INT_MOTION_0_ADDR                  UINT8_C(0x5F)
#define BMI160_INT_MOTION_1_ADDR                  UINT8_C(0x60)
#define BMI160_INT_MOTION_2_ADDR                  UINT8_C(0x61)
#define BMI160_INT_MOTION_3_ADDR                  UINT8_C(0x62)
#define BMI160_INT_TAP_0_ADDR                     UINT8_C(0x63)
#define BMI160_INT_TAP_1_ADDR                     UINT8_C(0x64)
#define BMI160_INT_ORIENT_0_ADDR                  UINT8_C(0x65)
#define BMI160_INT_ORIENT_1_ADDR                  UINT8_C(0x66)
#define BMI160_INT_FLAT_0_ADDR                    UINT8_C(0x67)
#define BMI160_INT_FLAT_1_ADDR                    UINT8_C(0x68)
#define BMI160_FOC_CONF_ADDR                      UINT8_C(0x69)
#define BMI160_CONF_ADDR                          UINT8_C(0x6A)

