YassineOABA/stm32f407_Breakout_VS_FW/Core/Inc/Bmi160/bmi160_defs.h
/* Gyro Output data rate */
#define BMI160_GYRO_ODR_RESERVED                  UINT8_C(0x00)
#define BMI160_GYRO_ODR_25HZ                      UINT8_C(0x06)
#define BMI160_GYRO_ODR_50HZ                      UINT8_C(0x07)
#define BMI160_GYRO_ODR_100HZ                     UINT8_C(0x08)
#define BMI160_GYRO_ODR_200HZ                     UINT8_C(0x09)
#define BMI160_GYRO_ODR_400HZ                     UINT8_C(0x0A)
#define BMI160_GYRO_ODR_800HZ                     UINT8_C(0x0B)
#define BMI160_GYRO_ODR_1600HZ                    UINT8_C(0x0C)
#define BMI160_GYRO_ODR_3200HZ                    UINT8_C(0x0D)

/* Auxiliary sensor Output data rate */
#define BMI160_AUX_ODR_RESERVED                   UINT8_C(0x00)
#define BMI160_AUX_ODR_0_78HZ                     UINT8_C(0x01)
#define BMI160_AUX_ODR_1_56HZ                     UINT8_C(0x02)
#define BMI160_AUX_ODR_3_12HZ                     UINT8_C(0x03)
#define BMI160_AUX_ODR_6_25HZ                     UINT8_C(0x04)
#define BMI160_AUX_ODR_12_5HZ                     UINT8_C(0x05)
#define BMI160_AUX_ODR_25HZ                       UINT8_C(0x06)
#define BMI160_AUX_ODR_50HZ                       UINT8_C(0x07)
#define BMI160_AUX_ODR_100HZ                      UINT8_C(0x08)
#define BMI160_AUX_ODR_200HZ                      UINT8_C(0x09)
#define BMI160_AUX_ODR_400HZ                      UINT8_C(0x0A)
#define BMI160_AUX_ODR_800HZ                      UINT8_C(0x0B)

/** FIFO_CONFIG Definitions */
#define BMI160_FIFO_TIME_ENABLE                   UINT8_C(0x02)
#define BMI160_FIFO_TAG_INT2_ENABLE               UINT8_C(0x04)
#define BMI160_FIFO_TAG_INT1_ENABLE               UINT8_C(0x08)
#define BMI160_FIFO_HEAD_ENABLE                   UINT8_C(0x10)
#define BMI160_FIFO_M_ENABLE                      UINT8_C(0x20)
#define BMI160_FIFO_A_ENABLE                      UINT8_C(0x40)
#define BMI160_FIFO_M_A_ENABLE                    UINT8_C(0x60)
#define BMI160_FIFO_G_ENABLE                      UINT8_C(0x80)
#define BMI160_FIFO_M_G_ENABLE                    UINT8_C(0xA0)
#define BMI160_FIFO_G_A_ENABLE                    UINT8_C(0xC0)
#define BMI160_FIFO_M_G_A_ENABLE                  UINT8_C(0xE0)

/* Macro to specify the number of bytes over-read from the
 * FIFO in order to get the sensor time at the end of FIFO */
#ifndef BMI160_FIFO_BYTES_OVERREAD
#define BMI160_FIFO_BYTES_OVERREAD                UINT8_C(25)
#endif

/* Accel, gyro and aux. sensor length and also their combined
 * length definitions in FIFO */
#define BMI160_FIFO_G_LENGTH                      UINT8_C(6)
#define BMI160_FIFO_A_LENGTH                      UINT8_C(6)
#define BMI160_FIFO_M_LENGTH                      UINT8_C(8)
#define BMI160_FIFO_GA_LENGTH                     UINT8_C(12)
#define BMI160_FIFO_MA_LENGTH                     UINT8_C(14)
#define BMI160_FIFO_MG_LENGTH                     UINT8_C(14)
#define BMI160_FIFO_MGA_LENGTH                    UINT8_C(20)

/** FIFO Header Data definitions */
#define BMI160_FIFO_HEAD_SKIP_FRAME               UINT8_C(0x40)
#define BMI160_FIFO_HEAD_SENSOR_TIME              UINT8_C(0x44)
#define BMI160_FIFO_HEAD_INPUT_CONFIG             UINT8_C(0x48)
#define BMI160_FIFO_HEAD_OVER_READ                UINT8_C(0x80)
#define BMI160_FIFO_HEAD_A                        UINT8_C(0x84)
#define BMI160_FIFO_HEAD_G                        UINT8_C(0x88)
#define BMI160_FIFO_HEAD_G_A                      UINT8_C(0x8C)
#define BMI160_FIFO_HEAD_M                        UINT8_C(0x90)
#define BMI160_FIFO_HEAD_M_A                      UINT8_C(0x94)
#define BMI160_FIFO_HEAD_M_G                      UINT8_C(0x98)
#define BMI160_FIFO_HEAD_M_G_A                    UINT8_C(0x9C)

/** FIFO sensor time length definitions */
#define BMI160_SENSOR_TIME_LENGTH                 UINT8_C(3)

/** FIFO DOWN selection */
/* Accel fifo down-sampling values*/
#define  BMI160_ACCEL_FIFO_DOWN_ZERO              UINT8_C(0x00)
#define  BMI160_ACCEL_FIFO_DOWN_ONE               UINT8_C(0x10)
#define  BMI160_ACCEL_FIFO_DOWN_TWO               UINT8_C(0x20)
#define  BMI160_ACCEL_FIFO_DOWN_THREE             UINT8_C(0x30)
#define  BMI160_ACCEL_FIFO_DOWN_FOUR              UINT8_C(0x40)
#define  BMI160_ACCEL_FIFO_DOWN_FIVE              UINT8_C(0x50)
#define  BMI160_ACCEL_FIFO_DOWN_SIX               UINT8_C(0x60)
#define  BMI160_ACCEL_FIFO_DOWN_SEVEN             UINT8_C(0x70)

/* Gyro fifo down-smapling values*/
#define  BMI160_GYRO_FIFO_DOWN_ZERO               UINT8_C(0x00)
#define  BMI160_GYRO_FIFO_DOWN_ONE                UINT8_C(0x01)
#define  BMI160_GYRO_FIFO_DOWN_TWO                UINT8_C(0x02)
#define  BMI160_GYRO_FIFO_DOWN_THREE              UINT8_C(0x03)
#define  BMI160_GYRO_FIFO_DOWN_FOUR               UINT8_C(0x04)
#define  BMI160_GYRO_FIFO_DOWN_FIVE               UINT8_C(0x05)
#define  BMI160_GYRO_FIFO_DOWN_SIX                UINT8_C(0x06)
#define  BMI160_GYRO_FIFO_DOWN_SEVEN              UINT8_C(0x07)

/* Accel Fifo filter enable*/
#define  BMI160_ACCEL_FIFO_FILT_EN                UINT8_C(0x80)

/* Gyro Fifo filter enable*/
#define  BMI160_GYRO_FIFO_FILT_EN                 UINT8_C(0x08)

/** Definitions to check validity of FIFO frames */
#define FIFO_CONFIG_MSB_CHECK                     UINT8_C(0x80)
#define FIFO_CONFIG_LSB_CHECK                     UINT8_C(0x00)

/*! BMI160 accel FOC configurations */
#define BMI160_FOC_ACCEL_DISABLED                 UINT8_C(0x00)
#define BMI160_FOC_ACCEL_POSITIVE_G               UINT8_C(0x01)
#define BMI160_FOC_ACCEL_NEGATIVE_G               UINT8_C(0x02)
#define BMI160_FOC_ACCEL_0G                       UINT8_C(0x03)

/** Array Parameter DefinItions */
#define BMI160_SENSOR_TIME_LSB_BYTE               UINT8_C(0)
#define BMI160_SENSOR_TIME_XLSB_BYTE              UINT8_C(1)
#define BMI160_SENSOR_TIME_MSB_BYTE               UINT8_C(2)

/** Interface settings */
#define BMI160_SPI_INTF                           UINT8_C(1)
#define BMI160_I2C_INTF                           UINT8_C(0)
#define BMI160_SPI_RD_MASK                        UINT8_C(0x80)
#define BMI160_SPI_WR_MASK                        UINT8_C(0x7F)

/* Sensor & time select definition*/
#define BMI160_ACCEL_SEL                          UINT8_C(0x01)
#define BMI160_GYRO_SEL                           UINT8_C(0x02)
#define BMI160_TIME_SEL                           UINT8_C(0x04)

/* Sensor select mask*/
#define BMI160_SEN_SEL_MASK                       UINT8_C(0x07)

/* Error code mask */
#define BMI160_ERR_REG_MASK                       UINT8_C(0x0F)

